app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
	  @post = Post.new(params)
	  @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "My Cool Post"], ["updated_at", "2019-05-09 18:35:24.626497"], ["id", 2]]
---
	def update
	  @post = Post.find(params[:id])
	  @post.update(post_params)